export const texts = {
generalText: `
## Інформація нижче буде найбільш корисною для ІТ-рекрутерів та розробників, які оцінюють технічну частину моїх проєктів.
`,



myProjectsText: `

## Інші сайти:


## AnimePotik-MPA
Мій **четвертий опублікований** проєкт. Він являє собою сайт для **перегляду аніме**, підключений до **Jikan API**.
### Основні відмінності AnimePotik-MPA від AnimeHub-SPA:

- **Архітектура:** AnimePotik-MPA побудований на архітектурі **MPA** (детальніше про різницю архітектур **читати на AnimeHub-SPA**).
- **Інше:** В іншому AnimePotik-MPA схожий на AnimePotik-SPA (детальніше читати нижче у розділі "AnimePotik-SPA", або переконатися особисто, перейшовши за посиланням нижче).

[Перейти на AnimePotik-MPA](https://kingalaluna.github.io/AnimePotik-MPA/)

### AnimePotik-MPA — проєкт з відкритим вихідним кодом

[Глянути вихідний код](https://github.com/KingAlaluna/AnimePotik-MPA.git)



## AnimeHub-MPA
Мій **третій опублікований** проєкт. Він являє собою сайт для **перегляду аніме**, підключений до **Jikan API**.
### Основні відмінності AnimeHub-MPA від AnimeHub-SPA:

- **Архітектура:** AnimeHub-MPA на архітектурі **MPA**, тоді як AnimeHub-SPA — на архітектурі **SPA**.
- **Інше:** Крім невеличких функціональних покращень (наприклад, запам'ятовування вибраної теми в AnimeHub-MPA), в іншому суттєвої різниці немає.

[Перейти на AnimeHub-MPA](https://kingalaluna.github.io/AnimeHub-MPA/)

### AnimeHub-MPA — проєкт з відкритим вихідним кодом

[Глянути вихідний код](https://github.com/KingAlaluna/AnimeHub-MPA.git)




## AnimeHub-SPA
Мій **другий опублікований** проєкт. Він являє собою сайт для **перегляду аніме**, підключений до **Jikan API**.
### Основні відмінності AnimeHub-SPA від AnimeHub-MPA:

- **Архітектура:** AnimeHub-SPA має архітектуру **SPA (1 .html файл)**, а AnimeHub-MPA має архітектуру **MPA (окремий .html файл для кожної сторінки)**.
- **Переваги AnimeHub-MPA над AnimeHub-SPA:** SEO-просування, автоматизація правильного функціонування системної кнопки "назад", автоматичне збереження поточної сторінки навіть при закритті браузера.
- **Недоліки:** Перезавантаження при переході на іншу сторінку, складніша взаємодія між різними сторінками, більше дублювань у коді.

[Перейти на AnimeHub-SPA](https://kingalaluna.github.io/AnimeHub-SPA/)

### AnimeHub-SPA — проєкт з відкритим вихідним кодом

[Глянути вихідний код](https://github.com/KingAlaluna/AnimeHub-SPA.git)




## AnimePotik-SPA
Мій **давній** та **перший опублікований** проєкт. Він являє собою сайт для **перегляду аніме**, підключений до **Jikan API**.
### Основні переваги AnimeHub-MPA над AnimePotik-SPA:

- **React та додаткові бібліотеки:** AnimeHub-MPA написаний з використанням фреймворку **React** для сучасної архітектури та бібліотек **Font Awesome** для іконок і **Marked** для транслювання мови розмітки **Markdown в HTML**. AnimePotik-SPA написаний на **Vanilla JavaScript**, без використання фреймворків та бібліотек.
- **Інформація:** AnimeHub-MPA, крім стандартної інформації про аніме, також підтримує **детальну інформацію** про **персонажів** аніме та **акторів/актрис**, які озвучували даного персонажа. AnimePotik-SPA підтримує **тільки** стандартну інформацію.
- **Улюблені аніме:** AnimeHub-MPA має можливість **додати аніме** в улюблене завдяки **localStorage**. AnimePotik-SPA такої можливості **не має**.
- **Фільтри:** AnimeHub-MPA дозволяє вибирати **декілька фільтрів** одночасно, залежно від можливостей **Jikan API**. AnimePotik-SPA дозволяє одночасно вибрати **тільки 1** фільтр.
- **Підтримуваність:** AnimeHub-MPA набагато легше **підтримувати та розширювати**, ніж AnimePotik-SPA, завдяки сучасному фреймворку **React** та бібліотекам **Font Awesome** і **Marked**.

[Перейти на AnimePotik-SPA](https://kingalaluna.github.io/AnimePotik-SPA/)

### AnimePotik-SPA — проєкт з відкритим вихідним кодом

[Глянути вихідний код](https://github.com/KingAlaluna/AnimePotik-SPA.git)



## Ігри:


## Flappy UFO-DOM
Мій **п'ятий опублікований** проєкт. Це гра схожа на **Flappy Bird**, але з оригінальними реалізаціями.


- **Архітектура:** SPA, DOM, Vanilla JavaScript. Дана комбінація технологій була обрана **свідомо, розуміючи всі недоліки**, її мета показати **глибоке розуміння** "чистих" технологій та DOM маніпуляцій.
- **Механіки:** Схожі на Flappy Bird, але замість птаха **НЛО (космічна тарілка)**. Можливо, в майбутньому буде значне розширення механік з додаванням **скінів, рівнів, та інших** можливостей.


[Перейти на Flappy UFO-DOM](https://kingalaluna.github.io/Flappy-UFO-DOM/)

## Flappy UFO-DOM проєкт з відкритим вихідним кодом

[Подивитися вихідний код](https://github.com/KingAlaluna/Flappy-UFO-DOM.git)



## Dino-DOM
Мій **шостий опублікований** проєкт. Це гра схожа на **Google Dino**, але з оригінальними реалізаціями.


- **Архітектура:** SPA, DOM, Vanilla JavaScript. Дана комбінація технологій була обрана **свідомо, розуміючи всі недоліки**, її мета показати **глибоке розуміння** "чистих" технологій та DOM маніпуляцій.
- **Механіки:** Схожі на Google Dino, але з оригінальними **асетами та іншими відміностями**. Можливо, в майбутньому буде значне розширення механік з додаванням **скінів, рівнів, та інших** можливостей.


[Перейти на Dino-DOM](https://kingalaluna.github.io/Dino-DOM/)

## Dino-DOM проєкт з відкритим вихідним кодом

[Подивитися вихідний код](https://github.com/KingAlaluna/Dino-DOM.git)


`,



myProjectsShortText: `
## Інші сайти:


### AnimePotik-MPA (аніме)
[Перейти на AnimePotik-MPA](https://kingalaluna.github.io/AnimePotik-MPA/)
[Глянути вихідний код](https://github.com/KingAlaluna/AnimePotik-MPA.git)


### AnimeHub-MPA (аніме)
[Перейти на AnimeHub-MPA](https://kingalaluna.github.io/AnimeHub-MPA/)
[Глянути вихідний код](https://github.com/KingAlaluna/AnimeHub-MPA.git)



### AnimeHub-SPA (аніме)
[Перейти на AnimeHub-SPA](https://kingalaluna.github.io/AnimeHub-SPA/)
[Глянути вихідний код](https://github.com/KingAlaluna/AnimeHub-SPA.git)




### AnimePotik-SPA (аніме)
[Перейти на AnimePotik-SPA](https://kingalaluna.github.io/AnimePotik-SPA/)
[Глянути вихідний код](https://github.com/KingAlaluna/AnimePotik-SPA.git)



## Ігри:


### Flappy UFO-DOM
[Перейти на Flappy UFO-DOM](https://kingalaluna.github.io/Flappy-UFO-DOM/)
[Подивитися вихідний код](https://github.com/KingAlaluna/Flappy-UFO-DOM.git)



### Dino-DOM
[Перейти на Dino-DOM](https://kingalaluna.github.io/Dino-DOM/)
[Подивитися вихідний код](https://github.com/KingAlaluna/Dino-DOM.git)


`,




aboutMeText: `
## 🛠️ Технічна Реалізація

### Код (Frontend):

- **React:** Проєкт написаний на **React**, демонструючи глибокі знання не тільки Vanilla JS, а й сучасних фреймворків.
- **Модульність:** Код розділений на окремі файли, кожен з яких виконує свою конкретну функцію (наприклад, "filterAnime.js" містить дані різних фільтрів аніме). Це забезпечує легку підтримку та масштабованість проєкту.
- **Оптимізація:** Код максимально компактний, ефективний та уникає дублювання (принцип DRY — Don't Repeat Yourself).
- **Динамічні дані:** Сайт підключений до реального, популярного публічного API – Jikan. (Детальніше про це в розділі "Jikan API").

### Дизайн та Адаптивність:

- **Гнучкий макет:** У верстці використовуються виключно адаптивні одиниці ("%", "vh", "vw", "vmin", "vmax") та медіазапити для коректного відображення, включно з альбомним режимом.
- **Мобільний пріоритет:** Оскільки проєкт розроблявся на телефоні (Android), його **вигляд на мобільних пристроях є ідеальним**. У зв'язку з відсутністю ПК, я не можу гарантувати такого ж ідеального відображення на десктопних моніторах без додаткового тестування.
- **Пошук балансу:** Під час самостійної розробки без макета було приділено багато уваги балансу між візуальною привабливістю та зручністю (UX), з вивченням дизайнерських рішень на інших ресурсах.
- **Еволюція дизайну:** Елементи, такі як градієнти, поле пошуку та банери, неодноразово змінювалися для досягнення найкращого результату.
- **Примітка розробника:** Як програміст, я надаю перевагу роботі за готовим макетом, оскільки це забезпечує швидкий результат, що відповідає очікуванням клієнта. Розробка власного ідеального дизайну є тривалим і складним процесом.

### Jikan API:

- **Опис:** Jikan API — це безкоштовний публічний API для отримання детальної інформації про аніме.
- **Обмеження:** Jikan надає лише інформаційні дані, тому функціонал перегляду серій (відеоплеєр) **відсутній**. З цієї ж причини не реалізовано функції, що потребують бекенду, такі як коментарі, оцінки, відгуки та вхід / реєстрація.
- **Вивантаження даних:** Оскільки API видає по 25 аніме за один запит, ця кількість є стандартною для відображення в усіх відповідних секціях сайту.
- **Різноманіття:** База даних Jikan містить інформацію про найрізноманітніші аніме (за роками, студіями, жанрами), включно з контентом для дорослих.


## ❓ FAQ (Часті Запитання)

### Відсутність даних:

- **Неповна інформація:** У деяких картках аніме може бути відсутня певна інформація (оцінка, віковий рейтинг, рік). Це не помилка коду, а **відсутність даних** безпосередньо в API Jikan для цих конкретних аніме. Я вирішив не виводити на екран написи на кшталт "Рік: невідомо", щоб не засмічувати інтерфейс.
- **Мова контенту:** На жаль, дані з Jikan доступні лише англійською та японською мовами. Однак, завдяки **автоматичному перекладу браузера**, який підтримується більшістю сучасних веб-оглядачів, ви зможете переглядати сайт своєю рідною мовою.


## 👤 Про Себе

- **Ім'я та Роль:** Мене звуть Віктор. Я — **Frontend-розробник** (верстальник), який прагне працювати на фрилансі.
- **Навички:** Впевнено володію мовами HTML, CSS, Vanilla JavaScript, SVG та JavaScript-фреймворком React. Маю досвід роботи з API та великими масивами і об'єктами локальних даних. Є досвід розробки багатьох **міні-ігор** та **сайтів** (не для портфоліо, для власного вдосконалення, можливо, в майбутньому я додам їх до портфоліо на **GitHub**). Досвіду роботи з бекендом не маю.
- **Портфоліо:** Це мій третій опублікований проєкт у портфоліо. Надалі планується додавання нових сайтів та ігор, а також доробка та публікація локальних проєктів.
- **Технічні умови:** Я працюю на **телефоні Android** (у зв'язку з відсутністю ПК), тому мої проєкти ідеально оптимізовані для мобільних пристроїв. Це також дозволяє мені робити якісні сайти та ігри для Android-платформи.
- **Звернення до клієнтів (Важлива примітка):** Звертаюсь до майбутніх клієнтів із проханням надавати **готовий макет** (Figma, Sketch) та **чіткі технічні вимоги**. Це значно прискорить розробку, забезпечить 100% відповідність вашим очікуванням і дозволить уникнути тривалого узгодження дизайну.

`,
};